// გვერდი 10, ამოცანა 6
// მეტეოროლოგმა ჩაიწერა მზის ამოსვლის და ჩასვლის დროები წამების სიზუსტით.
// თითოეული ჩანაწერი მოცემულია ჰარით გამოყოფილი სამი მთელი: A, B და C
// რიცხვებით, რომლებიც შესაბამისად აღნიშნავენ საათს, წუთსა და წამს.
// დაწერეთ პროგრამა, რომელიც გამოითვლის რამდენი წამი გავიდა დროის ამ ორ
// მომენტს შორის.

#include <iostream>

using namespace std;

int a1, b1, c1, a2, b2, c2, f, s, total;

int main(){
	cin >> a1 >> b1 >> c1;
	cin >> a2 >> b2 >> c2;

	f = a1*3600 + b1*60 + c1;
	s = a2*3600 + b2*60 + c2;
	total = s-f;
	cout << total;
	return 0;
}